Revit 2027 API
AssemblyDifferenceNamingCategory.NamingCategoryId1 Property
 Naming category id of the first assembly
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId NamingCategoryId1 { get; }
Public ReadOnly Property NamingCategoryId1 As ElementId
	Get
public:
property ElementId^ NamingCategoryId1 {
	ElementId^ get ();
}
member NamingCategoryId1 : ElementId with get
Property Value
ElementId
See Also
Reference
AssemblyDifferenceNamingCategory Class
Autodesk.Revit.DB Namespace